In [1]:
import pandas as pd

In [2]:
d={'Firstn':['aryan','rohan','riya','yash'],
  'Lastn':['singh','agarwal','shah','bhatt'],
  'Type':['FTE','IN','FTE','FTE'],
  'Dept':['Admin','Tech','Admin','Tech'],
  'Yoe':[2,3,5,7],
  'Salary':[20000,5000,10000,10000]}
df=pd.DataFrame(d)

In [5]:
p1=pd.pivot_table(df,index='Type',columns='Dept',values='Salary',aggfunc='mean')
p2=pd.pivot_table(df,index='Type',values='Salary',aggfunc=['sum','count','mean'])
p1

Dept    Admin     Tech
Type
FTE   15000.0  10000.0
IN        NaN   5000.0

In [6]:
p2

        sum  count          mean
     Salary Salary        Salary
Type
FTE   40000      3  13333.333333
IN     5000      1   5000.000000